m-gorecki/mynewt-nimble/nimble/drivers/nrf54l15/src/ble_phy.c
    ble_phy_trace_u32x2(BLE_PHY_TRACE_ID_START_TX, cputime, rem_usecs);

#if MYNEWT_VAL(BLE_LL_PHY)
    ble_phy_mode_apply(g_ble_phy_data.phy_tx_phy_mode);
#endif

    /* XXX: This should not be necessary, but paranoia is good! */
    /* Clear timer0 compare to RXEN since we are transmitting */
    phy_ppi_timer0_compare0_to_radio_rxen_disable();

    if (ble_phy_set_start_time(cputime, rem_usecs, true) != 0) {
        STATS_INC(ble_phy_stats, tx_late);
        ble_phy_disable();
        rc = BLE_PHY_ERR_TX_LATE;
    } else {
        /* Enable PPI to automatically start TXEN */
        phy_ppi_timer0_compare0_to_radio_txen_enable();
        rc = 0;
    }

    return rc;
}

/**
 * Called to set the start time of a reception
 *
 * This function acts a bit differently than transmit. If we are late getting
 * here we will still attempt to receive.
 *
 * NOTE: care must be taken when calling this function. The channel should
 * already be set.
 *
 * @param cputime
 *
 * @return int
 */
int
ble_phy_rx_set_start_time(uint32_t cputime, uint8_t rem_usecs)
{
    bool late = false;
    int rc = 0;

    ble_phy_trace_u32x2(BLE_PHY_TRACE_ID_START_RX, cputime, rem_usecs);

#if MYNEWT_VAL(BLE_LL_PHY)
    ble_phy_mode_apply(g_ble_phy_data.phy_rx_phy_mode);
#endif

    /* XXX: This should not be necessary, but paranoia is good! */
    /* Clear timer0 compare to TXEN since we are transmitting */
    phy_ppi_timer0_compare0_to_radio_txen_disable();

    if (ble_phy_set_start_time(cputime, rem_usecs, false) != 0) {
        STATS_INC(ble_phy_stats, rx_late);

        /* We're late so let's just try to start RX as soon as possible */
        ble_phy_set_start_now();

        late = true;
    }

    /* Enable PPI to automatically start RXEN */
    phy_ppi_timer0_compare0_to_radio_rxen_enable();

    /* Start rx */
    rc = ble_phy_rx();

    /*
     * If we enabled receiver but were late, let's return proper error code so
     * caller can handle this.
     */
    if (!rc && late) {
        rc = BLE_PHY_ERR_RX_LATE;
    }

    return rc;
}

static void
ble_phy_ccm_job_list_init(struct nrf_ccm_job_list *job_list, uint16_t *alen,
                          uint16_t *dlen, uint8_t *dbuff)
{
    job_list->alen.size = 2;
    job_list->alen.attributes = NRF_VDMA_ATTRIBUTE_CRC;
    job_list->alen.p_buffer = (uint8_t *) alen;

    job_list->adata.size = *alen;
    job_list->adata.p_buffer = NULL;
    job_list->adata.attributes = NRF_VDMA_ATTRIBUTE_PLAIN_DATA_BUF_WRITE;

    job_list->mlen.size = 2;
    job_list->mlen.attributes = NRF_VDMA_ATTRIBUTE_STATIC_ADDR;
    job_list->mlen.p_buffer = (uint8_t *) dlen;

    job_list->mdata.size = *dlen;
    job_list->mdata.p_buffer = (uint8_t *) dbuff;
    job_list->mdata.attributes = 14;

}

int
ble_phy_tx(ble_phy_tx_pducb_t pducb, void *pducb_arg, uint8_t end_trans)
{
    int rc;
    uint8_t *dptr;
    uint8_t *pktptr;
    uint8_t payload_len;
    uint8_t hdr_byte;
    uint32_t state;
    uint32_t shortcuts;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    static struct nrf_ccm_job_list ccm_jobs_in;
    static struct nrf_ccm_job_list ccm_jobs_out;
    static const uint16_t alen = 0;
    uint16_t dlen;
#endif

    if (g_ble_phy_data.phy_transition_late) {
        ble_phy_disable();
        STATS_INC(ble_phy_stats, tx_late);
        return BLE_PHY_ERR_TX_LATE;
    }

    /*
     * This check is to make sure that the radio is not in a state where
     * it is moving to disabled state. If so, let it get there.
     */
    nrf_wait_disabled();

    /*
     * XXX: Although we may not have to do this here, I clear all the PPI
     * that should not be used when transmitting. Some of them are only enabled
     * if encryption and/or privacy is on, but I dont care. Better to be
     * paranoid, and if you are going to clear one, might as well clear them
     * all.
     */
    phy_ppi_wfr_disable();
    phy_ppi_radio_bcmatch_to_aar_start_disable();
    phy_ppi_radio_address_to_ccm_crypt_disable();

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    if (g_ble_phy_data.phy_encrypted) {
        dptr = (uint8_t *)&g_ble_phy_enc_buf[0];
        pktptr = (uint8_t *)&g_ble_phy_tx_buf[0];
        NRF_CCM->IN.PTR = (uint32_t)dptr;
        NRF_CCM->OUT.PTR = (uint32_t)pktptr;
//        NRF_CCM->SCRATCHPTR = (uint32_t)&g_nrf_encrypt_scratchpad[0];
        NRF_CCM->EVENTS_ERROR = 0;
        NRF_CCM->MODE = CCM_MODE_MACLEN_Pos | ble_phy_get_ccm_datarate();
        memcpy((uint8_t *)NRF_CCM->KEY.VALUE, &g_nrf_ccm_data.key, sizeof(g_nrf_ccm_data.key));
    } else {
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
        NRF_AAR->IN.PTR = (uint32_t)&g_nrf_irk_list[0];
#endif
        dptr = (uint8_t *)&g_ble_phy_tx_buf[0];
        pktptr = dptr;
    }
#else
    dptr = (uint8_t *)&g_ble_phy_tx_buf[0];
    pktptr = dptr;
#endif

    /* Set PDU payload */
    payload_len = pducb(&dptr[3], pducb_arg, &hdr_byte);

    /* RAM representation has S0, LENGTH and S1 fields. (3 bytes) */
    dptr[0] = hdr_byte;
    dptr[1] = payload_len;
    dptr[2] = 0;

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    if (g_ble_phy_data.phy_encrypted) {
        ccm_jobs_in.alen.size = 2;
        ccm_jobs_in.alen.attributes = NRF_VDMA_ATTRIBUTE_CRC;
        ccm_jobs_in.alen.p_buffer = (uint8_t *) &alen;

        ccm_jobs_in.adata.size = alen;
        ccm_jobs_in.adata.p_buffer = NULL;
        ccm_jobs_in.adata.attributes = NRF_VDMA_ATTRIBUTE_PLAIN_DATA_BUF_WRITE;

        ccm_jobs_in.mlen.size = 2;
        ccm_jobs_in.mlen.attributes = NRF_VDMA_ATTRIBUTE_STATIC_ADDR;
        ccm_jobs_in.mlen.p_buffer = (uint8_t *) &dlen;

        ccm_jobs_in.mdata.size = dlen;
        ccm_jobs_in.mdata.p_buffer = (uint8_t *) dptr;
        ccm_jobs_in.mdata.attributes = 14;

        ccm_jobs_out.alen.size = 2;
        ccm_jobs_out.alen.attributes = 11;
        ccm_jobs_out.alen.p_buffer = (uint8_t *) &alen;

        ccm_jobs_out.adata.size = alen;
        ccm_jobs_out.adata.attributes = 13;
        ccm_jobs_out.adata.p_buffer = NULL;

        ccm_jobs_out.mlen.size = 2;
        ccm_jobs_out.mlen.attributes = 12;
        ccm_jobs_out.mlen.p_buffer = (uint8_t *) &dlen;

        ccm_jobs_out.mdata.size = dlen;
        ccm_jobs_out.mdata.attributes = 14;
        ccm_jobs_out.mdata.p_buffer = (uint8_t *) pktptr;

        /* Start key-stream generation and encryption (via short) */
        nrf_ccm_task_trigger(NRF_CCM, NRF_CCM_TASK_START);
    }
#endif

    NRF_RADIO->PACKETPTR = (uint32_t) pktptr;

    /* Clear the ready, end and disabled events */
    NRF_RADIO->EVENTS_READY = 0;
    NRF_RADIO->EVENTS_PHYEND = 0;
    NRF_RADIO->EVENTS_END = 0;
    NRF_RADIO->EVENTS_DISABLED = 0;

